ОперативныеЗадачиКР/src/Reports/ЗанятостьСборщиков_СКД/ЗанятостьСборщиков_СКД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЗанятостьСборщиков_СКД</name>
</mdclass:Report>

ОперативныеЗадачиКР/src/AccumulationRegisters/НачисленияСотрудникам/НачисленияСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачисленияСотрудникам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Компьютер</name>
    <type>
      <types>CatalogRef.Компьютеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиКР/src/Reports/ЗанятостьСборщиков_СКД/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)

	ТабДок = СформироватьТабличныйДокумент(Период);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТабличныйДокумент(парПериод)
	
	ТабДок = Новый ТабличныйДокумент;

	Макет = Отчеты.ЗанятостьСборщиков_СКД.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияСотрудникамОбороты.ФизическоеЛицо КАК Сборщик,
	|	ПРЕДСТАВЛЕНИЕ(НачисленияСотрудникамОбороты.ФизическоеЛицо),
	|	НачисленияСотрудникамОбороты.Компьютер,
	|	ПРЕДСТАВЛЕНИЕ(НачисленияСотрудникамОбороты.Компьютер),
	|	НачисленияСотрудникамОбороты.КоличествоОборот КАК Количество,
	|	НачисленияСотрудникамОбороты.СуммаОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.НачисленияСотрудникам.Обороты(&НачПериода, &КонПериода, , ) КАК НачисленияСотрудникамОбороты
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	Сборщик";
	
	Запрос.УстановитьПараметр("НачПериода", парПериод.ДатаНачала);
	Запрос.УстановитьПараметр("КонПериода", парПериод.ДатаОкончания);

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьСборщик = Макет.ПолучитьОбласть("Сборщик");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаСборщик = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаСборщик.Следующий() Цикл
		ОбластьСборщик.Параметры.Заполнить(ВыборкаСборщик);
		ТабДок.Вывести(ОбластьСборщик, ВыборкаСборщик.Уровень());

		ВыборкаДетальныеЗаписи = ВыборкаСборщик.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	
	Возврат ТабДок;
	
КонецФункции
